# 正则表达式基础语法
# 普通字符 ：字母、数字、汉字及大多数字符，直接匹配自身
# .        ：匹配任意一个字符（除 \n）
# \d       ：匹配数字 0-9
# \D       ：匹配非数字
# \w       ：匹配单词字符，即 a-z、A-Z、0-9、_、其他语言字符
# \W       ：匹配非单词字符
# \s	   ：匹配一个空白字符
# \S	   ：匹配一个非空白字符（字母、数字、符号等）
# [aeiou]  ：匹配其中的任何单个字符
# [^aeiou] ：求反，匹配不在字符列表中的任何单个字符
# [0-5]    ：表示范围
# *        ：出现任意次（0 次或无数次）
# +        ：至少出现 1 次（1 次或无数次）
# ?        ：至多出现一次（0 次或 1 次）
# {m}      ：出现 m 次
# {m,}     ：至少出现 m 次
# {m,n}    ：出现 m 到 n 次
# |        ：或的意思，匹配左右任意一个表达式
# ()       ：分组，将括号里的多个字符视为一个单元
# ^        ：匹配字符串开头
# $        ：匹配字符串结尾

import re

s1 = "18809090000是我的手机号，188开头的，以00结尾的；我的另一个手机号是15500008888，两个QQ号分别是1259989092和13809091293821，邮箱为python666@163.com，请给我发邮件。"

# 正则表达式
print(re.findall(r"188.*", s1))  # * 匹配任何个
print(re.findall(r"188.?", s1))  # ? 匹配0个或者1个（最多出现一次）
print(re.findall(r"188.+", s1))  # + 匹配1个或者多个（最少出现一次）

print(re.findall(r"188\d{8}", s1))  # {8} 匹配8个
print(re.findall(r"155\d{6,10}", s1))  # {6,10} 匹配6到10个
print(re.findall(r"155\d{6,}", s1))  # {6,} 匹配6个或者更多

print(re.findall(r"1[38]\d{8}", s1))  # [38] 匹配3或者8
print(re.findall(r"1[^38]\d{8}", s1))  # [^38] 匹配非 3或者8
print(re.findall(r"1[3-9]\d{8}", s1))  # [3-9] 匹配3到9（范围）
print(re.findall(r"^1[3-9]\d{9}", s1))  # ^ 匹配开头
print(re.findall(r"^1[3-9]\d{9}$", s1))  # $ 匹配结尾

print(re.findall(r"\w+@\w+\.\w+", s1))  # \w 匹配任何单词字符(a-z、A-Z、0-9、_、其它语言字符) -- 默认行为
print(re.findall(r"\w+@\w+\.\w+", s1, re.ASCII))  # \w 匹配任何单词字符(a-z、A-Z、0-9、_)

# 注意
s2 = "现在的时间是2026-02-06 10:05:25，今天的天气还可以，气温是28度 "
print(re.findall(r"\d{4}-\d{2}-\d{2}", s2))
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})", s2))
