package com.itheima.loopfor;

public class ForDemo3 {
    static void main() {
        /*
         * for 循环练习
         *
         * 需求：在实际开发中，如果要获取一个范围中的每一个数据时，就会用到循环。
         * 要求：求 1~5 之间的和
         *
         */

        // 1. 定义求和变量
        int sum = 0;

        // 2.获取1-5这个范围中的每一个数字，累加到sum当中
        // 第一次循环：i = 1 判断 i <= 5
        //             1 + 0 = 1 ---> sum
        //             i++  i = 2  第一次循环结束

        // 第二次循环：i <= 5
        //             2 + 1 = 3 ---> sum
        //             i++  i = 3  第二次循环结束

        // 第三次循环：i <= 5
        //             3 + 3 = 6 ---> sum
        //             i++  i = 4  第三次循环结束

        // 第四次循环：i <= 5
        //             4 + 6 = 10 ---> sum
        //             i++  i = 5  第四次循环结束

        // 第五次循环：i <= 5
        //             5 + 10 = 15 ---> sum
        //             i++  i = 6  第五次循环结束

        // 第六次循环：i <= 5 --- 6 <= 5 false -- 循环结束
        for (int i = 1; i <= 5; i++) {
            sum = i + sum;
        }

        System.out.println("1~5之间的数字之和为：" + sum);

    }
}
