package com.itheima.loopfor;

public class ForDemo1 {
    static void main() {
        /*
         * for 循环
         * 语法格式：
         * for (初始化语句 ; 条件判断语句 ; 条件控制语句) {
         *      循环体语句; // 重复执行 -> 跳的代码
         * }
         *
         * 1. 初始化语句：循环的开始条件（只执行一次，通常用于定义循环变量）
         * 2. 条件判断语句：循环的结束条件（若为 true 则继续循环，若为 false 则结束循环）
         * 3. 条件控制语句：控制变量如何变化（每次循环体执行完后执行，控制循环走向终点）
         * 4. 循环体语句：要重复执行的代码（真正在循环中做事情的代码块）
         *
         */

        // 实现游戏中连续跳跃10次，用输出语句模拟跳跃的逻辑
        for (int i = 1; i <= 10; i++) {
            System.out.println("游戏人物在跳跃第" + i + "次");
        }
    }
}
