package com.itheima.literal;

public class LiteralDemo1 {
    static void main() {
        /*
         * 字面量类型（字面量）
         * -------------------------------------------------------------------------
         * 字面量类型       说明                                举例
         * -------------------------------------------------------------------------
         * 整数类型         直接写                             18, -88
         * 小数类型         直接写，加上小数点                   1.93, -5.21
         * 字符串类型       用双引号引起来                       "尼古拉斯·纯情·暖男·天真·阿玮"
         * 字符类型         用单引号引起来的，内容只能有一个        '男', 'A', '0'
         * 布尔类型         布尔值，表示真假                     true, false
         * 空类型           一个特殊的值，空值                   null
         * -------------------------------------------------------------------------
         */


        // 输出恐龙的信息：霸王龙 8岁 11.5 公
        // 输出恐龙的名字
        System.out.println("霸王龙");

        // 输出恐龙的年龄
        System.out.println(8);

        // 输出恐龙的体重
        System.out.println(11.5);

        // 输出恐龙的性别
        System.out.println('公');

    }
}
